PC1/PC1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-06 seg 11:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Práticas Computacionais I (~v0.0.2~)</title>
<meta name="author" content="Daniel R. Cassar" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Práticas Computacionais I (<code>v0.0.2</code>)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Índice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org12c8356">1. Introdução</a></li>
<li><a href="#orga6bd518">2. Jupyter, variáveis, e como buscar ajuda</a>
<ul>
<li><a href="#org0ed0bda">2.1. Meu primeiro caderno de notas Jupyter</a></li>
<li><a href="#orgd9027ef">2.2. Criando variáveis de diferentes tipos</a></li>
<li><a href="#org94d9f51">2.3. Buscando ajuda</a></li>
</ul>
</li>
<li><a href="#org2aeb91a">3. Operadores e estrutura de decisão</a>
<ul>
<li><a href="#org5fdb0d1">3.1. Operadores aritméticos</a></li>
<li><a href="#org8d57f9a">3.2. Operadores lógicos</a></li>
<li><a href="#org145646e">3.3. Operadores de comparação</a></li>
<li><a href="#orge35a8e3">3.4. Estrutura de decisão e operador condicional</a></li>
</ul>
</li>
<li><a href="#orgfa61fe9">4. <span class="todo TODO">TODO</span> Listas, tuplas, e conjuntos</a>
<ul>
<li><a href="#org2a182b5">4.1. Agrupando objetos com listas</a></li>
<li><a href="#orgdb155fa">4.2. Modificando, particionando e desempacotando listas</a></li>
<li><a href="#orgeaeb9f9">4.3. &ldquo;Tuplas são listas imutáveis&rdquo;</a></li>
<li><a href="#org693d31a">4.4. &ldquo;Conjuntos são listas sem elementos repetidos&rdquo;</a></li>
</ul>
</li>
<li><a href="#orgb388dcb">5. <span class="todo TODO">TODO</span> Laço de repetição</a>
<ul>
<li><a href="#orgfeee559">5.1. Laço de repetição usando <code>while</code></a></li>
<li><a href="#org3fe5009">5.2. Laço de repetição usando <code>for</code></a></li>
<li><a href="#org5a3f406">5.3. Iterando sobre listas com o operador de filiação</a></li>
<li><a href="#org6d227da">5.4. Compreensão de listas</a></li>
</ul>
</li>
<li><a href="#org0486358">6. <span class="todo TODO">TODO</span> Funções</a>
<ul>
<li><a href="#orgc96b230">6.1. Funções embutidas</a></li>
<li><a href="#orgf5acad6">6.2. Definindo novas funções</a></li>
<li><a href="#orgfb19413">6.3. Argumentos posicionais, argumentos nomeados, e argumentos com valor padrão</a></li>
<li><a href="#orgc1649b8">6.4. Variáveis globais e variáveis locais</a></li>
<li><a href="#org48d4309">6.5. Documentando suas funções com docstring</a></li>
</ul>
</li>
<li><a href="#org988ab43">7. <span class="todo TODO">TODO</span> Depuração de programas</a>
<ul>
<li><a href="#orgedc98f8">7.1. Meu programa não roda pois dá um erro, e agora?</a></li>
<li><a href="#org9c63e97">7.2. Meu programa não faz o que eu queria que ele fizesse, e agora?</a></li>
<li><a href="#orgc7bb44c">7.3. Tratamento de exceções</a></li>
</ul>
</li>
<li><a href="#orga5715a0">8. <span class="todo TODO">TODO</span> Dicionários</a>
<ul>
<li><a href="#orgd0cc089">8.1. Associando objetos com dicionários</a></li>
<li><a href="#org85b1cca">8.2. Modificando e desempacotando dicionários</a></li>
<li><a href="#org2d12b6b">8.3. Iterando sobre dicionários</a></li>
<li><a href="#orgd008729">8.4. Funções com argumentos estrela &lowast;args e &lowast;&lowast;kwargs</a></li>
</ul>
</li>
<li><a href="#org4341747">9. <span class="todo TODO">TODO</span> Strings e processamento de texto</a>
<ul>
<li><a href="#org6d48e9a">9.1. Agrupando caracteres com strings</a></li>
<li><a href="#org58607c1">9.2. Recebendo informações do usuário com o comando <code>input</code></a></li>
<li><a href="#orgbb5e9b8">9.3. Tipos de strings</a></li>
<li><a href="#org94d2a5a">9.4. Processamento de texto</a></li>
<li><a href="#org65f87da">9.5. Expressões regulares</a></li>
</ul>
</li>
<li><a href="#orge128ff5">10. <span class="todo TODO">TODO</span> Programação orientada a objetos</a>
<ul>
<li><a href="#org0357e93">10.1. Agrupando objetos com classes</a></li>
<li><a href="#org43f9885">10.2. Classes e seus métodos</a></li>
<li><a href="#orga536f48">10.3. Métodos mágicos</a></li>
<li><a href="#orge71e067">10.4. Herança de classes</a></li>
</ul>
</li>
<li><a href="#orgc6759c7">11. <span class="todo TODO">TODO</span> Biblioteca padrão</a>
<ul>
<li><a href="#org6ac010d">11.1. O que são e como importar módulos de Python</a></li>
<li><a href="#orgd6a31b6">11.2. Módulos embutidos</a></li>
</ul>
</li>
<li><a href="#orgd11aff0">12. <span class="todo TODO">TODO</span> Leitura e manipulação de dados com o módulo <code>pandas</code></a>
<ul>
<li><a href="#org39c1d68">12.1. Criando e manipulando DataFrames a partir de arquivos</a></li>
<li><a href="#org0506a28">12.2. Análise dos dados</a></li>
<li><a href="#org7927a5f">12.3. Criando e exportando um DataFrame a partir de listas</a></li>
</ul>
</li>
<li><a href="#orgf65e884">13. <span class="todo TODO">TODO</span> Graficando dados</a>
<ul>
<li><a href="#orgcf47095">13.1. Graficando dados de um DataFrame</a></li>
<li><a href="#orgeb3222d">13.2. Graficando dados usando <code>matplotlib</code></a></li>
</ul>
</li>
<li><a href="#org34cfc69">14. <span class="todo TODO">TODO</span> Controle de versão usando <code>git</code></a></li>
<li><a href="#org87f9bf7">15. <span class="todo TODO">TODO</span> Computação científica com <code>numpy</code> e <code>scipy</code></a></li>
</ul>
</div>
</div>


<div id="outline-container-org12c8356" class="outline-2">
<h2 id="org12c8356"><span class="section-number-2">1.</span> Introdução</h2>
<div class="outline-text-2" id="text-1">
Bem-vinda(o) à disciplina de Práticas Computacionais I.

<p>
A maioria das práticas contém um breve texto introdutório e uma ou mais questões. As questões são marcadas com uma letra em negrito e entre chaves. <b>[A]</b> Por exemplo, aqui seria o enunciado da questão <b>A</b> se estivéssemos dentro do escopo de uma prática.
</p>

<p>
Realize as práticas seguindo as instruções discutidas em sala de aula. Lembre-se que a capacidade de ler, entender, escrever, e depurar seu próprio código de computador é <i>fundamental</i> para realizar diversas disciplinas da Ilum (incluindo, obviamente, todas as disciplinas de computação). Por este motivo, se atente às dicas abaixo:
</p>

<ul class="org-ul">
<li>A maioria das práticas são individuais. Tente resolver as questões no seu computador antes de discutir em grupo. Depois de tentar resolver, fique à vontade para discutir em grupo e observar outras formas de resolver o mesmo problema;</li>

<li>Algumas práticas te convidam a executar algum código pronto para ver o que acontece. Mesmo sendo possível copiar e colar o código, é fortemente recomendado <i>escrever</i> o código pois aprendemos mais quando escrevemos do que quando copiamos e colamos;</li>

<li>Praticamente todos os problemas computacionais que serão explorados nesta disciplina já foram resolvidos por alguém e a solução pode ser encontrada em livros ou na internet. Isso é inevitável para problemas <i>simples</i>. Mais adiante no curso (ou na vida) iremos nos deparar com problemas mais <i>difíceis</i> e mais específicos, que não têm soluções prontas. Para resolver problemas difíceis precisamos ter uma base sólida que só adquirimos resolvendo problemas mais simples. Aproveite esse momento de aprendizado e evite buscar respostas prontas <i>antes</i> de tentar resolver o problema! Depois que você tentou resolver, fique à vontade para procurar e estudar outras soluções.</li>
</ul>

<p>
Ao fim de todas as práticas é necessário enviar o seu caderno de notas Jupyter na plataforma Moodle. Preencha seu caderno de notas seguindo o modelo fornecido. O nome do arquivo deve conter seu nome, sobrenome e RA.
</p>
</div>
</div>

<div id="outline-container-orga6bd518" class="outline-2">
<h2 id="orga6bd518"><span class="section-number-2">2.</span> Jupyter, variáveis, e como buscar ajuda</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-org0ed0bda" class="outline-3">
<h3 id="org0ed0bda"><span class="section-number-3">2.1.</span> Meu primeiro caderno de notas Jupyter</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Usualmente, a primeira prática quando se está aprendendo uma linguagem de programação nova é a chamada &ldquo;Olá, mundo!&rdquo;. Nesta prática, o objetivo é criar seu primeiro programa na linguagem Python que, quando executado, exiba a mensagem &ldquo;Olá, Mundo!&rdquo;.
</p>

<p>
<b>[A]</b> Crie um caderno de notas Jupyter seguindo o modelo discutido na Introdução. Neste caderno, crie uma célula de código contendo o código abaixo. Execute esta célula e observe o que acontece. Escreva brevemente sobre o que você observou.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"Ol&#225;, mundo!"</span>)
</pre>
</div>

<p>
Observe que no código acima temos três elementos: o comando <code>print</code>, um conjunto de parênteses, e um texto delimitado por aspas duplas. O comando <code>print</code> é o que chamamos de função. Veremos funções mais adiante, mas por hora basta saber que funções são &ldquo;apelidos&rdquo; para executar códigos que já foram escritos. Neste caso, <code>print</code> é uma função embutida de Python cujo código já foi escrito pelos próprios criadores do Python, por isso você pode usar esta função sem a necessidade de defini-la. A palavra <i>print</i> poderia ser traduzida para o português como <i>imprimir</i>, porém o termo <i>exibir</i> se encaixa melhor no uso corriqueiro desta função.
</p>

<p>
Para executar funções precisamos chamá-las usando os parênteses. Se tiver curiosidade, tente criar e executar uma célula no Jupyter apenas com a palavra <code>print</code> para ver o que acontece quando escrevemos o nome de uma função sem chamá-la com o parênteses.
</p>

<p>
Por fim, dentro dos parênteses que usamos para chamar a função <code>print</code> nós escrevemos os argumentos da função. Neste caso, temos apenas um argumento e ele foi o texto &ldquo;Olá, mundo!&rdquo;.
</p>

<p>
Aprender qualquer linguagem, seja ela de programação ou não, requer treino. Não se preocupe se as regras de Python parecem esquisitas, com o passar do tempo você irá ler e escrever códigos em Python com mais facilidade. Afinal, você não aprendeu português de um dia para o outro, não é?
</p>
</div>
</div>
