PC1/PC1.html

<div id="outline-container-orgd9027ef" class="outline-3">
<h3 id="orgd9027ef"><span class="section-number-3">2.2.</span> Criando variáveis de diferentes tipos</h3>
<div class="outline-text-3" id="text-2-2">
<p>
É comum em programação situações onde precisamos armazenar informações em variáveis para usá-las mais tarde. Python oferece diversos tipos de variáveis como, por exemplo, números inteiros (<code>int</code>), números reais (<code>float</code>), e variáveis que armazenam texto (<code>string</code>).
</p>

<p>
<b>[A]</b> O código abaixo cria diversas variáveis. Reescreva e execute este código em uma célula do Jupyter. Veja que para atribuir valores à variáveis nós usamos o sinal de igual (<code>=</code>). Note que para o Python, o separador decimal é o ponto (<code>.</code>) e não a vírgula (<code>,</code>); muita atenção com essa distinção pois a vírgula tem outro significado em Python e não necessariamente vai acusar um erro no seu código!! <span class="underline">Lembrete</span>: mesmo sendo possível copiar e colar o código, sugiro fortemente <i>escrever</i> o código abaixo pois aprendemos muito mais quando escrevemos do que quando copiamos e colamos.
</p>

<p>
Usando a função <code>type</code> e a função <code>print</code>, identifique os tipos das variáveis definidas no código que você escreveu. Exemplo: <code>print(type(numero_inteiro))</code>. Quantos tipos diferentes você identificou? Quais foram eles?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">texto_com_aspas_simples</span> = <span style="color: #2aa198;">'Ol&#225;, Mundo!'</span>
<span style="color: #268bd2;">texto_com_aspas_duplas</span> = <span style="color: #2aa198;">"Ol&#225;, Mundo!"</span>
<span style="color: #268bd2;">texto_com_aspas_triplas</span> = <span style="color: #2aa198;">'''Ol&#225;, Mundo!'''</span>

<span style="color: #268bd2;">numero_inteiro</span> = <span style="color: #6c71c4; font-weight: bold;">10</span>
<span style="color: #268bd2;">numero_inteiro_positivo</span> = +<span style="color: #6c71c4; font-weight: bold;">10</span>
<span style="color: #268bd2;">numero_inteiro_negativo</span> = -<span style="color: #6c71c4; font-weight: bold;">10</span>

<span style="color: #268bd2;">numero_real</span> = <span style="color: #6c71c4; font-weight: bold;">10.0</span>
<span style="color: #268bd2;">numero_real_sem_digitos_depois_do_ponto</span> = <span style="color: #6c71c4; font-weight: bold;">10</span>.
<span style="color: #268bd2;">numero_real_positivo</span> = +<span style="color: #6c71c4; font-weight: bold;">10.0000</span>
<span style="color: #268bd2;">numero_real_negativo</span> = -<span style="color: #6c71c4; font-weight: bold;">10.0000</span>
<span style="color: #268bd2;">numero_real_base_dez</span> = <span style="color: #6c71c4; font-weight: bold;">1</span>.5e7
<span style="color: #268bd2;">pi</span> = <span style="color: #6c71c4; font-weight: bold;">3.1415</span>

<span style="color: #268bd2;">numero_complexo</span> = <span style="color: #6c71c4; font-weight: bold;">2</span> + 3j
<span style="color: #268bd2;">numero_complexo_apenas_parte_imaginaria</span> = 5j
<span style="color: #268bd2;">numero_complexo_apenas_parte_real</span> = <span style="color: #6c71c4; font-weight: bold;">1</span> + 0j

<span style="color: #268bd2;">variavel_booleana_verdadeiro</span> = <span style="color: #6c71c4; font-weight: bold;">True</span>
<span style="color: #268bd2;">variavel_booleana_falso</span> = <span style="color: #6c71c4; font-weight: bold;">False</span>

<span style="color: #268bd2;">variavel_nula</span> = <span style="color: #6c71c4; font-weight: bold;">None</span>
</pre>
</div>

<p>
<b>[B]</b> Em uma célula de texto responda as perguntas:
</p>

<ol class="org-ol">
<li>Existe diferença de se criar uma string usando aspas simples, duplas, ou triplas? Reflita sobre a resposta e busque informações na internet antes de escrever. Não se esqueça de colocar as fontes na sua resposta.</li>
<li>Qual a diferença entre um número real e um número inteiro? Pelos exemplos do código acima, qual seria a regra para definir números inteiros e números reais?</li>
<li>Qual a regra para declarar números complexos? O que é o <code>j</code> na declaração dos números complexos?</li>
<li>Na sua opinião, existe diferença entre as variáveis <code>numero_inteiro</code> e <code>numero_inteiro_positivo</code>? Explique brevemente seu raciocínio.</li>
<li>Na sua opinião, existe diferença entre as variáveis <code>numero_real</code>, e <code>numero_real_positivo</code>, e <code>numero_real_sem_digitos_depois_do_ponto</code>? Explique brevemente seu raciocínio. De que forma você faria para confirmar a sua resposta?</li>
</ol>

<p>
<b>[C]</b> O código abaixo <i>supostamente</i> cria novas variáveis. No entanto, algumas das declarações parecem&#x2026; diferente&#x2026; quem sabe até estranhas! Seu objetivo é testar cada uma destas declarações e separar as que funcionam das que não funcionam. Para as declarações que não funcionam, descreva o erro que ocorreu e proponha uma correção.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">variavel_que_o_nome_termina_com_numero_100</span> = <span style="color: #6c71c4; font-weight: bold;">1</span>
<span style="color: #268bd2;">100_variavel_que_o_nome_comeca_com_numero</span> = <span style="color: #6c71c4; font-weight: bold;">1</span>
<span style="color: #268bd2;">numero_do_agente_secreto</span> = <span style="color: #6c71c4; font-weight: bold;">007</span>

<span style="color: #268bd2;">nome_da_vari&#225;vel_com_acento</span> = <span style="color: #6c71c4; font-weight: bold;">True</span>
<span style="color: #268bd2;">booleano_sem_primeira_letra_maiuscula</span> = true

<span style="color: #268bd2;">espaco_entre_os_numeros</span> = <span style="color: #6c71c4; font-weight: bold;">100</span> <span style="color: #6c71c4; font-weight: bold;">000</span>
<span style="color: #268bd2;">numero_com_sublinhado</span> = 10_000_000

<span style="color: #268bd2;">numero_com_muitos_sinais_de_menos</span> = -----<span style="color: #6c71c4; font-weight: bold;">10</span>
<span style="color: #268bd2;">numero_com_muitos_sinais_de_mais</span> = +++++<span style="color: #6c71c4; font-weight: bold;">10</span>
<span style="color: #268bd2;">numero_com_muitos_sinais_de_mais_e_menos</span> = +--++-<span style="color: #6c71c4; font-weight: bold;">10</span>

<span style="color: #268bd2;">muitos_espacos_entre_o_sinal_de_igual</span>     =      <span style="color: #6c71c4; font-weight: bold;">10</span>
<span style="color: #268bd2;">nenhum_espaco_entre_o_sinal_de_igual</span>=<span style="color: #6c71c4; font-weight: bold;">10</span>

<span style="color: #268bd2;">texto</span> = Ol&#225;, Mundo!
<span style="color: #268bd2;">texto</span> = <span style="color: #2aa198;">"Ol&#225;, Mundo!'</span>
</pre>
</div>
</div>
</div>
