PC1/PC1.html

<div id="outline-container-org94d9f51" class="outline-3">
<h3 id="org94d9f51"><span class="section-number-3">2.3.</span> Buscando ajuda</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Nas práticas anteriores usamos a função <code>print</code> para exibir informações na forma de texto dentro do próprio caderno de notas do Jupyter. A função <code>print</code> é uma <i>função embutida</i> do Python. Isto que dizer que qualquer usuário que tenha o Python instalado (idealmente na mesma versão que a sua) terá acesso a esta função sem a necessidade de executar nenhum comando adicional.
</p>

<p>
Na prática, nós já sabemos que a função <code>print</code> recebe como argumento o texto ou variável que será exibido. Argumentos de funções são as informações que estão dentro dos parênteses quando executamos as funções; o argumento da função <code>print</code> em <code>print(1234)</code> é o número 1234. Funções podem receber um ou mais argumentos, bem como podem receber zero argumentos (tente rodar <code>print()</code> e veja o que acontece!). Os argumentos das funções são definidos no momento quando a função é definida (vamos ver isso em mais detalhes em uma prática futura).
</p>

<p>
O que você faria se não soubesse o que função <code>print</code> faz? Digamos, por exemplo, que você viu essa função sendo usada em um código de Python mas não sabe sua funcionalidade. Como proceder? Algumas sugestões neste caso são:
</p>

<ol class="org-ol">
<li>Pesquisar na internet em busca de alguma página com explicações (Python é uma linguagem de programação muito usada, existe muito material didático disponível online);</li>
<li>Pesquisar na documentação oficial do Python disponível em português no link <a href="https://docs.python.org/pt-br/3/">https://docs.python.org/pt-br/3/</a>. Todas as funções embutidas de Python, por exemplo, estão descritas aqui: <a href="https://docs.python.org/pt-br/3/library/functions.html">https://docs.python.org/pt-br/3/library/functions.html</a>;</li>
<li>Usar a função <code>help</code> do próprio Python (tente rodar <code>help(print)</code> no seu caderno de notas e veja o que acontece);</li>
<li>Usar a sintaxe própria do Jupyter para buscar ajuda. Para isso basta digitar a função que quer saber mais informações junto com um sinal de interrogação. Neste caso seria <code>print?</code>.</li>
</ol>

<p>
<b>[A]</b> Escolha uma das quatro sugestões acima para ler mais sobre a função <code>print</code> do Python. Observe que a função <code>print</code> aceita diferentes argumentos, sendo eles: <code>value</code>, <code>file</code>, <code>flush</code>, <code>end</code>, e <code>sep</code>. Escreva como foi sua busca (incluindo fontes se for o caso) e descreva com suas palavras o que os argumentos <code>end</code> e <code>sep</code> fazem. Tente outras formas de busca caso julge necessário.
</p>

<p>
<b>[B]</b> Escolha pelo menos duas funções da lista abaixo. Para cada função escolhida, faça uma busca online (buscas 1 ou 2) e uma busca offline (buscas 3 ou 4) para entender o que estas funções fazem. Escreva como foi sua busca (incluindo fontes) e descreva com suas palavras o que estas funções fazem.
</p>

<ul class="org-ul">
<li><code>round</code></li>
<li><code>pow</code></li>
<li><code>oct</code></li>
<li><code>abs</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2aeb91a" class="outline-2">
<h2 id="org2aeb91a"><span class="section-number-2">3.</span> Operadores e estrutura de decisão</h2>
<div class="outline-text-2" id="text-3">
</div>
