PC1/PC1.html

<div id="outline-container-org5fdb0d1" class="outline-3">
<h3 id="org5fdb0d1"><span class="section-number-3">3.1.</span> Operadores aritméticos</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A linguagem Python contém diversos operadores aritméticos como adição (<code>+</code>), subtração (<code>-</code>), multiplicação (<code>*</code>), divisão (<code>/</code>), e exponencial (<code>**</code>). Estes operadores permitem realizar cálculos aritméticos com números inteiros, reais, e complexos. <span class="underline">Cuidado</span>: em Python, a exponenciação é representada por dois asteriscos; não confundir com o acento circunflexo (<code>^</code>) que é o operador de exponenciação usado no Excel!
</p>

<p>
<b>[A]</b> Reescreva o código abaixo em uma célula do Jupyter e veja o que acontece. Comente porque o resultado da terceira linha foi <code>100.25</code> e não <code>5.25</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">1</span> - <span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1</span> - <span style="color: #6c71c4; font-weight: bold;">1</span>)
<span style="color: #859900; font-weight: bold;">print</span>(-<span style="color: #6c71c4; font-weight: bold;">10</span> + <span style="color: #6c71c4; font-weight: bold;">10.5</span> * <span style="color: #6c71c4; font-weight: bold;">10.5</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">10</span> / <span style="color: #6c71c4; font-weight: bold;">2</span> * <span style="color: #6c71c4; font-weight: bold;">5</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">10</span> ** <span style="color: #6c71c4; font-weight: bold;">10</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">2</span> ** <span style="color: #6c71c4; font-weight: bold;">1</span> / <span style="color: #6c71c4; font-weight: bold;">2</span>)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #6c71c4; font-weight: bold;">2</span> ** (<span style="color: #6c71c4; font-weight: bold;">1</span> / <span style="color: #6c71c4; font-weight: bold;">2</span>))
<span style="color: #859900; font-weight: bold;">print</span>((<span style="color: #6c71c4; font-weight: bold;">1</span> + 1j) / (<span style="color: #6c71c4; font-weight: bold;">1</span> - 1j))
</pre>
</div>

<p>
A ordem de precedência dos operadores aritméticos (isto é, qual é a ordem de execução dos operadores) segue a regra do PEMDAS: parênteses, exponencial, multiplicação, divisão, adição, e subtração. Assim como na notação matemática, usamos parênteses para dar preferência para certas operações.
</p>

<p>
<b>[B]</b> Utilizando os operadores aritméticos do Python, compute:
</p>
<ol class="org-ol">
<li>Quantos segundos existem em 16 horas e 42 minutos?</li>
<li>Quantos centímetros existem em 72,8 milhas?</li>
<li>Se você percorrer 72,8 milhas em 16 horas e 42 minutos, qual a sua velocidade média em centímetros por segundo?</li>
<li>Quanto tempo você demoraria para percorrer a circunferência da Terra na linha do equador se permanecer na velocidade média obtida no item acima?</li>
</ol>

<p>
<b>[C]</b> Além dos operadores discutidos acima, existem diversos outros em Python. Dois operadores bastante úteis são a divisão inteira (<code>//</code>) e o módulo (<code>%</code>, também conhecido como resto da divisão inteira). Teste estes operadores e descreva como eles funcionam (em caso de dúvida, busque ajuda assim como discutido na Seção Buscando Ajuda). Discorra brevemente sobre possíveis situações onde estes operadores podem ser úteis.
</p>

<p>
<span class="underline">Atenção</span>: operadores aritméticos usualmente funcionam com qualquer combinação de números inteiros, reais, ou complexos. No entanto, preste atenção no tipo do resultado final!
</p>

<p>
<b>[D]</b> Escreva e execute o código abaixo e comente sobre o resultado obtido. Escreva um código similar ao código abaixo, porém alterando o operador de adição pelo operador de divisão. Você obteve algum resultado inusitado? Comente.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">inteiro_mais_inteiro</span> = <span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1</span>
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(inteiro_mais_inteiro))

<span style="color: #268bd2;">inteiro_mais_real</span> = <span style="color: #6c71c4; font-weight: bold;">1</span> + <span style="color: #6c71c4; font-weight: bold;">1.5</span>
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(inteiro_mais_real))

<span style="color: #268bd2;">real_mais_real</span> = <span style="color: #6c71c4; font-weight: bold;">1.5</span> + <span style="color: #6c71c4; font-weight: bold;">1.5</span>
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(real_mais_real))

<span style="color: #268bd2;">inteiro_mais_complexo</span> = <span style="color: #6c71c4; font-weight: bold;">10</span> + (<span style="color: #6c71c4; font-weight: bold;">1</span> - 2j)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(inteiro_mais_complexo))

<span style="color: #268bd2;">real_mais_complexo</span> = <span style="color: #6c71c4; font-weight: bold;">10.5</span> + (<span style="color: #6c71c4; font-weight: bold;">1</span> - 2j)
<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #d33682; font-style: italic;">type</span>(real_mais_complexo))
</pre>
</div>

<p>
<b>Desafio</b>: durante um exercício de geometria, você decidiu realizar suas contas utilizando Python. Você escreveu o código abaixo em uma célula no seu caderno de notas Jupyter e o resultado que obteve foi inusitado! Por que o resultado é inusitado? Qual era o resultado esperado? Qual é a explicação para isso? Na sua opinião, este tipo de &ldquo;problema&rdquo; compromete o uso de Python como uma calculadora aritmética?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">pi</span> = <span style="color: #6c71c4; font-weight: bold;">3.14</span>
<span style="color: #268bd2;">valor</span> = pi + <span style="color: #6c71c4; font-weight: bold;">2</span>
<span style="color: #859900; font-weight: bold;">print</span>(valor)
</pre>
</div>
</div>
</div>
