PC1/PC1.html

<div id="outline-container-orgfa61fe9" class="outline-2">
<h2 id="orgfa61fe9"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> Listas, tuplas, e conjuntos</h2>
<div class="outline-text-2" id="text-4">
</div>

<div id="outline-container-org2a182b5" class="outline-3">
<h3 id="org2a182b5"><span class="section-number-3">4.1.</span> Agrupando objetos com listas</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>listas simples</li>
<li>listas dentro de listas</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb155fa" class="outline-3">
<h3 id="orgdb155fa"><span class="section-number-3">4.2.</span> Modificando, particionando e desempacotando listas</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>métodos <code>append</code>, <code>extend</code>, <code>pop</code></li>
<li>slicing</li>
<li>a, &lowast;b, c = lista</li>
</ul>
</div>
</div>

<div id="outline-container-orgeaeb9f9" class="outline-3">
<h3 id="orgeaeb9f9"><span class="section-number-3">4.3.</span> &ldquo;Tuplas são listas imutáveis&rdquo;</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>diferença entre objetos mutáveis e imutáveis</li>
<li>cópia rasa e cópia profunda</li>
</ul>
</div>
</div>

<div id="outline-container-org693d31a" class="outline-3">
<h3 id="org693d31a"><span class="section-number-3">4.4.</span> &ldquo;Conjuntos são listas sem elementos repetidos&rdquo;</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>métodos de união, subtração, e intersecção de conjuntos</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb388dcb" class="outline-2">
<h2 id="orgb388dcb"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> Laço de repetição</h2>
<div class="outline-text-2" id="text-5">
</div>

<div id="outline-container-orgfeee559" class="outline-3">
<h3 id="orgfeee559"><span class="section-number-3">5.1.</span> Laço de repetição usando <code>while</code></h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>não esquecer de comentar do loop infinito <code>while True</code></li>
</ul>
</div>
</div>

<div id="outline-container-org3fe5009" class="outline-3">
<h3 id="org3fe5009"><span class="section-number-3">5.2.</span> Laço de repetição usando <code>for</code></h3>
</div>
<div id="outline-container-org5a3f406" class="outline-3">
<h3 id="org5a3f406"><span class="section-number-3">5.3.</span> Iterando sobre listas com o operador de filiação</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>operador <code>in</code></li>
</ul>
</div>
</div>

<div id="outline-container-org6d227da" class="outline-3">
<h3 id="org6d227da"><span class="section-number-3">5.4.</span> Compreensão de listas</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>açúcar sintático</li>
<li>pode ser tanto mais rápido quanto mais legível (mas nem sempre!)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0486358" class="outline-2">
<h2 id="org0486358"><span class="section-number-2">6.</span> <span class="todo TODO">TODO</span> Funções</h2>
<div class="outline-text-2" id="text-6">
</div>

<div id="outline-container-orgc96b230" class="outline-3">
<h3 id="orgc96b230"><span class="section-number-3">6.1.</span> Funções embutidas</h3>
<div class="outline-text-3" id="text-6-1">
<p>
dir(<span class="underline"><span class="underline">builtins</span></span>)
</p>

<ul class="org-ul">
<li><code>len</code></li>
<li><code>print</code></li>
<li><code>range</code></li>
<li><code>list</code></li>
<li><code>set</code></li>
<li><code>type</code></li>
<li><code>input</code></li>
<li><code>help</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgf5acad6" class="outline-3">
<h3 id="orgf5acad6"><span class="section-number-3">6.2.</span> Definindo novas funções</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>argumentos</li>
<li>corpo da função</li>
<li>retorno</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb19413" class="outline-3">
<h3 id="orgfb19413"><span class="section-number-3">6.3.</span> Argumentos posicionais, argumentos nomeados, e argumentos com valor padrão</h3>
</div>

<div id="outline-container-orgc1649b8" class="outline-3">
<h3 id="orgc1649b8"><span class="section-number-3">6.4.</span> Variáveis globais e variáveis locais</h3>
</div>
<div id="outline-container-org48d4309" class="outline-3">
<h3 id="org48d4309"><span class="section-number-3">6.5.</span> Documentando suas funções com docstring</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li>comentar sobre <code>pep8</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org988ab43" class="outline-2">
<h2 id="org988ab43"><span class="section-number-2">7.</span> <span class="todo TODO">TODO</span> Depuração de programas</h2>
<div class="outline-text-2" id="text-7">
</div>

<div id="outline-container-orgedc98f8" class="outline-3">
<h3 id="orgedc98f8"><span class="section-number-3">7.1.</span> Meu programa não roda pois dá um erro, e agora?</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>tipos de erros</li>
</ul>
</div>
</div>

<div id="outline-container-org9c63e97" class="outline-3">
<h3 id="org9c63e97"><span class="section-number-3">7.2.</span> Meu programa não faz o que eu queria que ele fizesse, e agora?</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>técnicas de debug</li>
<li>pythontutor <a href="https://pythontutor.com/visualize.html#mode=edit">https://pythontutor.com/visualize.html#mode=edit</a></li>
<li>módulo <code>pdb</code></li>
<li>recordar o tópico &ldquo;buscando ajuda&rdquo;</li>
</ul>
</div>
</div>

<div id="outline-container-orgc7bb44c" class="outline-3">
<h3 id="orgc7bb44c"><span class="section-number-3">7.3.</span> Tratamento de exceções</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>bloco <code>try</code> / <code>except</code> / <code>finally</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga5715a0" class="outline-2">
<h2 id="orga5715a0"><span class="section-number-2">8.</span> <span class="todo TODO">TODO</span> Dicionários</h2>
<div class="outline-text-2" id="text-8">
</div>

<div id="outline-container-orgd0cc089" class="outline-3">
<h3 id="orgd0cc089"><span class="section-number-3">8.1.</span> Associando objetos com dicionários</h3>
</div>
<div id="outline-container-org85b1cca" class="outline-3">
<h3 id="org85b1cca"><span class="section-number-3">8.2.</span> Modificando e desempacotando dicionários</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>método <code>pop</code></li>
<li>adicionando nova chave</li>
<li>deletando uma chave</li>
</ul>
</div>
</div>

<div id="outline-container-org2d12b6b" class="outline-3">
<h3 id="org2d12b6b"><span class="section-number-3">8.3.</span> Iterando sobre dicionários</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>métodos <code>items</code>, <code>get</code>, <code>keys</code>, <code>values</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgd008729" class="outline-3">
<h3 id="orgd008729"><span class="section-number-3">8.4.</span> Funções com argumentos estrela &lowast;args e &lowast;&lowast;kwargs</h3>
</div>
</div>

<div id="outline-container-org4341747" class="outline-2">
<h2 id="org4341747"><span class="section-number-2">9.</span> <span class="todo TODO">TODO</span> Strings e processamento de texto</h2>
<div class="outline-text-2" id="text-9">
</div>

<div id="outline-container-org6d48e9a" class="outline-3">
<h3 id="org6d48e9a"><span class="section-number-3">9.1.</span> Agrupando caracteres com strings</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>strings são imutáveis</li>
<li>convertendo objetos para strings com <code>str</code></li>
<li>convertendo strings para inteiros e reais com <code>int</code> e <code>float</code></li>
<li>iterando em strings com <code>for</code></li>
<li>checando prefixos e sufixos com <code>startswith</code> e <code>endswith</code></li>
<li>checando caracteres com <code>isnumeric</code>, <code>isupper</code>, <code>islower</code></li>
</ul>
</div>
</div>

<div id="outline-container-org58607c1" class="outline-3">
<h3 id="org58607c1"><span class="section-number-3">9.2.</span> Recebendo informações do usuário com o comando <code>input</code></h3>
</div>

<div id="outline-container-orgbb5e9b8" class="outline-3">
<h3 id="orgbb5e9b8"><span class="section-number-3">9.3.</span> Tipos de strings</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>utf-8
<ul class="org-ul">
<li>caracteres especiais tipo \n e \t</li>
</ul></li>
<li>raw</li>
<li>fstring</li>
</ul>
</div>
</div>

<div id="outline-container-org94d2a5a" class="outline-3">
<h3 id="org94d2a5a"><span class="section-number-3">9.4.</span> Processamento de texto</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li><code>split</code> e <code>join</code></li>
<li><code>translate</code> e <code>maketrans</code></li>
<li><code>capitalize</code>, <code>title</code>, <code>lower</code>, <code>upper</code>, <code>swapcase</code></li>
<li><code>replace</code></li>
</ul>
</div>
</div>

<div id="outline-container-org65f87da" class="outline-3">
<h3 id="org65f87da"><span class="section-number-3">9.5.</span> Expressões regulares</h3>
</div>
</div>

<div id="outline-container-orge128ff5" class="outline-2">
<h2 id="orge128ff5"><span class="section-number-2">10.</span> <span class="todo TODO">TODO</span> Programação orientada a objetos</h2>
<div class="outline-text-2" id="text-10">
</div>

<div id="outline-container-org0357e93" class="outline-3">
<h3 id="org0357e93"><span class="section-number-3">10.1.</span> Agrupando objetos com classes</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>classes como um único objeto para tratar de dados e funções</li>
<li>sintaxe</li>
<li>instância</li>
<li>parâmetros</li>
<li><code>self</code></li>
</ul>
</div>
</div>

<div id="outline-container-org43f9885" class="outline-3">
<h3 id="org43f9885"><span class="section-number-3">10.2.</span> Classes e seus métodos</h3>
</div>
<div id="outline-container-orga536f48" class="outline-3">
<h3 id="orga536f48"><span class="section-number-3">10.3.</span> Métodos mágicos</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>dunders</li>
<li>_<sub>init</sub>__</li>
<li>_<sub>str</sub>__</li>
<li>_<sub>repr</sub>__</li>
</ul>
</div>
</div>

<div id="outline-container-orge71e067" class="outline-3">
<h3 id="orge71e067"><span class="section-number-3">10.4.</span> Herança de classes</h3>
</div>
</div>

<div id="outline-container-orgc6759c7" class="outline-2">
<h2 id="orgc6759c7"><span class="section-number-2">11.</span> <span class="todo TODO">TODO</span> Biblioteca padrão</h2>
<div class="outline-text-2" id="text-11">
</div>

<div id="outline-container-org6ac010d" class="outline-3">
<h3 id="org6ac010d"><span class="section-number-3">11.1.</span> O que são e como importar módulos de Python</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>sintaxe para importar um módulo (com ou sem apelido)</li>
<li>sintaxe para importar objetos de um módulo</li>
<li>conceito de namespace (&ldquo;espaço de nome&rdquo;)</li>
<li>reforçar que cada módulo tem sua documentação (ou deveria ter&#x2026;)</li>
<li>Módulos para usar como exemplo: <code>math</code> e <code>random</code></li>
</ul>
</div>
</div>
