PC1/PC1.html

<div id="outline-container-orgd6a31b6" class="outline-3">
<h3 id="orgd6a31b6"><span class="section-number-3">11.2.</span> Módulos embutidos</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>os que eu acho mais interessantes são:
<ul class="org-ul">
<li>os</li>
<li>sys</li>
<li>functools</li>
<li>itertools</li>
<li>math</li>
<li>pathlib</li>
<li>pdb</li>
<li>pprint</li>
<li>random</li>
<li>re</li>
<li>statistics</li>
<li>pickle</li>
<li>abc?</li>
<li>collections</li>
<li>datetime</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd11aff0" class="outline-2">
<h2 id="orgd11aff0"><span class="section-number-2">12.</span> <span class="todo TODO">TODO</span> Leitura e manipulação de dados com o módulo <code>pandas</code></h2>
<div class="outline-text-2" id="text-12">
</div>

<div id="outline-container-org39c1d68" class="outline-3">
<h3 id="org39c1d68"><span class="section-number-3">12.1.</span> Criando e manipulando DataFrames a partir de arquivos</h3>
</div>
<div id="outline-container-org0506a28" class="outline-3">
<h3 id="org0506a28"><span class="section-number-3">12.2.</span> Análise dos dados</h3>
<div class="outline-text-3" id="text-12-2">
<ul class="org-ul">
<li>Estatística descritiva</li>
</ul>
</div>
</div>
<div id="outline-container-org7927a5f" class="outline-3">
<h3 id="org7927a5f"><span class="section-number-3">12.3.</span> Criando e exportando um DataFrame a partir de listas</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li>Criando um dataframe usando listas de python</li>
<li>Exportar para csv</li>
<li>Exportar para xlsx</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf65e884" class="outline-2">
<h2 id="orgf65e884"><span class="section-number-2">13.</span> <span class="todo TODO">TODO</span> Graficando dados</h2>
<div class="outline-text-2" id="text-13">
</div>

<div id="outline-container-orgcf47095" class="outline-3">
<h3 id="orgcf47095"><span class="section-number-3">13.1.</span> Graficando dados de um DataFrame</h3>
</div>
<div id="outline-container-orgeb3222d" class="outline-3">
<h3 id="orgeb3222d"><span class="section-number-3">13.2.</span> Graficando dados usando <code>matplotlib</code></h3>
</div>
</div>

<div id="outline-container-org34cfc69" class="outline-2">
<h2 id="org34cfc69"><span class="section-number-2">14.</span> <span class="todo TODO">TODO</span> Controle de versão usando <code>git</code></h2>
<div class="outline-text-2" id="text-14">
</div>
</div>

<div id="outline-container-org87f9bf7" class="outline-2">
<h2 id="org87f9bf7"><span class="section-number-2">15.</span> <span class="todo TODO">TODO</span> Computação científica com <code>numpy</code> e <code>scipy</code></h2>
<div class="outline-text-2" id="text-15">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel R. Cassar</p>
<p class="date">Created: 2021-12-06 seg 11:21</p>
</div>
</body>
</html>
